Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceIgnoresSplitters Property
 Revit cannot create a rectangular grid by intersecting the current selection of elements (levels, reference planes, or curves drawn on reference planes) with the surface. Make sure that curves do not form closed loops. It is helpful if curves start and end outside the surface, rather than inside it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceIgnoresSplitters { get; }
Public Shared ReadOnly Property DividedSurfaceIgnoresSplitters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceIgnoresSplitters {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceIgnoresSplitters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace